tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"

brew "autojump"
brew "mas"
brew "neovim"
brew "zsh"
brew "zsh-completions
brew "zsh-autosuggestions"
brew "git"

cask "contexts"
cask "fork"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "ticktick"
cask "typora"
cask "visual-studio-code"
cask "zoomus"
cask "alfred"
cask "charles"

mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
mas "截图", id: 1059334054
