tap "bufbuild/buf"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/cask-fonts"
tap "peripheryapp/periphery"
brew "autojump"
brew "bat"
brew "binutils"
brew "btop"
brew "clang-format"
brew "cmake"
brew "dust"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "openjdk"
brew "gradle"
brew "helix"
brew "jq"
brew "mackup"
brew "mas"
brew "neovim"
brew "protobuf"
brew "pv"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "sqlcipher"
brew "starship"
brew "swift-format"
brew "swift-protobuf"
brew "swiftformat"
brew "tmux"
brew "tokei"
brew "tree"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "bufbuild/buf/buf"
cask "arc"
cask "alacritty"
cask "charles"
cask "db-browser-for-sqlite"
cask "flutter"
cask "font-fira-code-nerd-font"
cask "fork"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "obsidian"
cask "paw"
cask "periphery"
cask "raycast"
cask "slack"
cask "telegram"
cask "ticktick"
cask "typora"
cask "visual-studio-code"
cask "warp"
cask "xcodes"
mas "GoodNotes", id: 1444383602
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
vscode "eamodio.gitlens"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
