tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/cask-fonts"

brew "autojump"
brew "starship"
brew "mas"
brew "neovim"
brew "fzf"
brew "fish"
brew "git"
brew "tree"
brew "bat"
brew "exa"
brew "dust"
brew "git-delta"
brew "fd"
brew "ripgrep"

cask "font-fira-code-nerd-font"

cask "fork"
cask "iterm2"
cask "karabiner-elements"
cask "ticktick"
cask "typora"
cask "visual-studio-code"
cask "charles"
cask "raycast"

mas "Magnet", id: 441258766
